// -------------------------------------------------
// 09. 테스트 주도 개발 (TDD)
// -------------------------------------------------
// - snakeCase() → 'snake_case'
// - kebabCase() → 'kebab-case'
// - camelCase() → 'camelCase'
// - titleCase() → 'TitleCase'
// -------------------------------------------------


// -------------------------------------------------
// 정규 표현식 (Regular Expression)
// -------------------------------------------------
// - https://ko.javascript.info/regexp-introduction
// - https://www.regextester.com
// - \w 단어(`W`ord)       ←→ \W 단어가 들어가지 않는 문자
// - \d 숫자(`D`igit)      ←→ \S 숫자가 아닌 문자
// - \s 공백(white`S`pace) ←→ \S 공백이 아닌 문자
// - . 모든 문자 (\n 제외)
// -------------------------------------------------
